balazsgrill/modembed/pic/core/hu.modembed.pic/device-descriptors/16xxxx/PIC16LF1904.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="SP1BRGH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="SP1BRGH" edc:nzwidth="8" edc:por="00000000">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="SPBRGH"/>
            <edc:MigrationAlias edc:cname="SPBRGH1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="BRG8" edc:desc="" edc:mask="0x1" edc:name="BRG8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRG9" edc:desc="" edc:mask="0x1" edc:name="BRG9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRG10" edc:desc="" edc:mask="0x1" edc:name="BRG10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRG11" edc:desc="" edc:mask="0x1" edc:name="BRG11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRG12" edc:desc="" edc:mask="0x1" edc:name="BRG12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRG13" edc:desc="" edc:mask="0x1" edc:name="BRG13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRG14" edc:desc="" edc:mask="0x1" edc:name="BRG14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRG15" edc:desc="" edc:mask="0x1" edc:name="BRG15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RC1STA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000x" edc:name="RC1STA" edc:nzwidth="8" edc:por="0000000x">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RCSTA"/>
            <edc:MigrationAlias edc:cname="RCSTA1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="TX1STA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000010" edc:name="TX1STA" edc:nzwidth="8" edc:por="00000010">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TXSTA"/>
            <edc:MigrationAlias edc:cname="TXSTA1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nn-nn" edc:cname="BAUD1CON" edc:desc="" edc:impl="0xdb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="01-00-00" edc:name="BAUD1CON" edc:nzwidth="8" edc:por="01-00-00">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="BAUDCON"/>
            <edc:MigrationAlias edc:cname="BAUDCON1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="ABDEN" edc:desc="" edc:mask="0x1" edc:name="ABDEN" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WUE" edc:desc="" edc:mask="0x1" edc:name="WUE" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="BRG16" edc:desc="" edc:mask="0x1" edc:name="BRG16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="SCKP" edc:desc="" edc:mask="0x1" edc:name="SCKP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="RCIDL" edc:desc="" edc:mask="0x1" edc:name="RCIDL" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="ABDOVF" edc:desc="" edc:mask="0x1" edc:name="ABDOVF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="4" edc:beginaddr="0x200" edc:endaddr="0x220" edc:regionid="sfr4">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="1"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="WPUB" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="WPUB" edc:nzwidth="0x8" edc:por="11111111">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="WPUB0" edc:desc="" edc:mask="0x1" edc:name="WPUB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB1" edc:desc="" edc:mask="0x1" edc:name="WPUB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB2" edc:desc="" edc:mask="0x1" edc:name="WPUB2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB3" edc:desc="" edc:mask="0x1" edc:name="WPUB3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB4" edc:desc="" edc:mask="0x1" edc:name="WPUB4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB5" edc:desc="" edc:mask="0x1" edc:name="WPUB5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB6" edc:desc="" edc:mask="0x1" edc:name="WPUB6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="WPUB7" edc:desc="" edc:mask="0x1" edc:name="WPUB7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="WPUB" edc:desc="" edc:mask="0xff" edc:name="WPUB" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="2"/>
        <edc:SFRDef edc:access="----n---" edc:cname="WPUE" edc:desc="" edc:impl="0x08" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----1---" edc:name="WPUE" edc:nzwidth="8" edc:por="----1---">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="WPUE3" edc:desc="" edc:mask="0x1" edc:name="WPUE3" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="15"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="5" edc:beginaddr="0x280" edc:endaddr="0x2A0" edc:regionid="sfr5">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="20"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="6" edc:beginaddr="0x300" edc:endaddr="0x320" edc:regionid="sfr6">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="20"/>
      </edc:SFRDataSector>
      <edc:SFRDataSector edc:bank="7" edc:beginaddr="0x380" edc:endaddr="0x3A0" edc:regionid="sfr7">
        <edc:Mirror edc:nzsize="12" edc:regionidref="sfr0"/>
        <edc:AdjustPoint edc:offset="8"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IOCBP" edc:desc="Interrupt-On-Change Positive Edge Register" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="IOCBP" edc:nzwidth="0x8" edc:por="00000000">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="IOCBP0" edc:desc="" edc:mask="0x1" edc:name="IOCBP0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP1" edc:desc="" edc:mask="0x1" edc:name="IOCBP1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP2" edc:desc="" edc:mask="0x1" edc:name="IOCBP2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP3" edc:desc="" edc:mask="0x1" edc:name="IOCBP3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP4" edc:desc="" edc:mask="0x1" edc:name="IOCBP4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP5" edc:desc="" edc:mask="0x1" edc:name="IOCBP5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP6" edc:desc="" edc:mask="0x1" edc:name="IOCBP6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="IOCBP7" edc:desc="" edc:mask="0x1" edc:name="IOCBP7" edc:nzwidth="1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="IOCBP" edc:desc="Interrupt-On-Change Positive Edge Register" edc:mask="0xff" edc:name="IOCBP" edc:nzwidth="8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
